app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('"G", "1"', '"PG", "1"', '"PG-13", "1"', '"R", "1"')  ORDER BY release_date
---
    def index
      @all_ratings = Movie.all_ratings

      if !session.key?(:ratings) || !session.key?(:sort_by)
        @all_ratings_hash = Hash[@all_ratings.collect {|key| [key, '1']}]